#ifndef CARDMGR_H
#define CARDMGR_H

#include <dolphin/card.h>
#include <dolphin/CARDPriv.h>

#include "Osako/SaveFile.h"

namespace CardMgr
{ // Autogenerated
    // Global
    enum ProcessFlag
    {
        // Not complete
        mcProbe = 1,
        mcMount = 2,
        mcCheck = 4,
        mcOpen = 0x20,
        mcClose = 0x100,
        mcGetStatus = 0x200,
        mcRetry = 0x800
    };

    struct CardData
    {
        s32 mProbeStatus;         // 0x0
        s32 mPrevProbeStatus;     // 0x4, only gets set to mProbeStatus in CardAgent::ask in a specific case, gets loaded and compared against mProbeStatus in CardAgent::waitSelect
        s32 *mMemSize;            // 0x8
        s32 mSectorSize;          // 0xc
        s32 *mByteNotUsed;        // 0x10
        s32 *mFilesNotUsed;       // 0x14
        int mTaskStatus;          // 0x18 enum?
        ProcessFlag mProcessFlag; // 0x1c
        s32 mCardStatus;          // 0x20
        SaveFile *mSaveFile;      // 0x24
        void *mWorkArea;          // 0x28
        CARDFileInfo mFileinfo;   // 0x2c
        CARDStat mStat;           // 0x40
    };                            // Size: 0xac

    void create();                                     // 0x802016e0
    void probe();                                      // 0x8020175c
    void mount(s32 chan);                              // 0x80201800
    void mountTask(void *chan);                        // 0x80201914
    void check(s32 chan);                              // 0x802019d8
    void checkTask(void *chan);                        // 0x80201a90
    void format(s32 chan);                             // 0x80201b34
    void formatTask(void *chan);                       // 0x80201b94
    void openFile(s32 chan, SaveFile *);               // 0x80201c0c
    void createFile(s32 chan, SaveFile *pSaveFile);    // 0x80201d88
    void createTask(void *chan);                       // 0x80201e54
    void read(s32 chan, SaveFile::FilePart filePart);  // 0x80201f60
    void readTask(void *chan);                         // 0x80202090
    void write(s32 chan, SaveFile::FilePart filePart); // 0x80202150
    void writeTask(void *chan);                        // 0x8020231c
    void setStatus(s32 chan);                          // 0x80202400
    void setStatusTask(void *chan);                    // 0x802024c0
    void renameFile(s32 chan);                         // 0x8020269c
    void renameTask(void *chan);                       // 0x8020275c
    void deleteFile(s32 chan);                         // 0x80202800
    void deleteTask(void *chan);                       // 0x802028c0
    void closeFile(s32 chan);                          // 0x80202990
    void unmount(s32 chan);                            // 0x80202a10
    static CardData *msaCardData[2];                   // 0x80400b68
    static u8 msProbeSlot;                             // 0x804169c8
};                                                     // namespace CardMgr

#endif // CARDMGR_H