#ifndef SECRETSCENE_H
#define SECRETSCENE_H

#include "JSystem/J2D/J2DAnimation.h"
#include "JSystem/J2D/J2DGrafContext.h"
#include "JSystem/J2D/J2DPane.h"
#include "JSystem/JGeometry/Vec.h"
#include "JSystem/JKernel.h"
#include "JSystem/J2D/J2DScreen.h"
#include "JSystem/JParticle/JPAEmitter.h"
#include "JSystem/ResTIMG.h"
#include "Kameda/CharacterSelect3D.h"
#include "Kameda/PrintWindow.h"
#include "Kameda/Scene.h"
#include "Sato/JPEffectMgr.h"
#include "Sato/StateObserver.h"
#include "kartEnums.h"
#include "macros.h"

class TAutoPWindow : public StateObserver {
public:
    ~TAutoPWindow();
    void InitExec();
    void MoveExec();
    void initFunc_BeforeOpen();
    void initFunc_Hide();
    void doFunc_Hide();
    void initFunc_Open();
    void doFunc_Open();
    void initFunc_Display();
    void setMessageID(u32, int, int, int, int);
    void setMessage(J2DTextBox *, int, int, int, int);
    void doFunc_Display();
    void initFunc_Close();
    void doFunc_Close();
    static StateFuncSet<TAutoPWindow> sTable[5];

    // Inline/Unused
    TAutoPWindow(JKRHeap *, J2DScreen *, J2DAnmTransform *);
    void parseBlo(JKRHeap *);
    void reset();
    void setType(u32);
    void setAnimationFrame(f32);
    void calc();
    void draw();
    void doFunc_BeforeOpen();
    //static const char *scTextBoxName;
    static const int scBufferSize;

    void setAudioIDs(u32 startID, u32 endID) {
        mAudioIDOpen = startID;
        mAudioIDClose = endID;
    }

    void setFrames(f32 start, f32 end) {
        mOpenFrame = start;
        mCloseFrame = end;
        mSkipBtnMask = KartGamePad::A; // might also be an argument
    }

private:
    PrintWindow *mPrintWindow;   // 0c
    f32 mOpenFrame;              // 10
    f32 mCloseFrame;             // 14
    u32 mSkipBtnMask;            // 18
    u32 mType;                   // 1c
    u32 mAudioIDOpen;            // 20
    u32 mAudioIDClose;           // 24
    J2DScreen *mScreen;          // 28
    J2DAnmTransform *mTransform; // 2c
    J2DTextBox *_30;             //
    J2DTextBox *_34;             //
    char *mStrBuf;               // 38
    void *mBmg;                  // 3c
    void *mBmc;                  // 40
}; // Size: 0x44

class SecretScene : public Scene, StateObserver { // Autogenerated
public:

    class TMesgList {
    public:
        int _0;
        int _4;
        int _8;
        int _c;
    }; // Size: 0x10

    SecretScene(JKRArchive *, JKRHeap *); // 0x802d94f0
    void init(); // 0x802d9714
    void reset(); // 0x802d974c
    void checkFlag(); // 0x802d9890
    void load(JKRHeap *); // 0x802d9b6c
    void draw(); // 0x802d9e1c
    void calc(); // 0x802d9f94
    void initFunc_FadeIn(); // 0x802da2d0
    void setMessageID(u32, const TMesgList &); // 0x802da368
    void doFunc_FadeIn(); // 0x802da3a0
    void initFunc_Screen1(); // 0x802da3dc
    void doFunc_Screen1(); // 0x802da478
    void initFunc_Screen2(); // 0x802da4c4
    void doFunc_Screen2(); // 0x802da5b8
    void initFunc_FadeOut(); // 0x802da840
    void doFunc_FadeOut(); // 0x802da8a4
    
    static const TMesgList scSecretGameMesgList1[9]; // 0x80385cb0
    static const TMesgList scSecretGameMesgList2[9]; // 0x80385d40
    static const TMesgList scSecretKartMesgList1[13]; // 0x80385dd0
    static const TMesgList scSecretKartMesgList2[13]; // 0x80385ea0
    static const f32 scKartScale[13]; // 0x80385f90
    static const f32 scCharScale[2][2]; // 0x80385fc4
    static const EKartID scSecret2KartID[13]; // 0x80386054
    static const char *scTextureName[5]; // 0x803ab1fc
    static StateObserver::StateFuncSet<SecretScene> sTable[4]; // 0x803ab270
    static const JGeometry::TVec3f scCameraPos; // 0x80413bec
    static const JGeometry::TVec3f scCameraTarget; // 0x80413dcc
    static const JGeometry::TVec3f scKartPos[13]; // 0x80413dd8
    static const JGeometry::TVec3f scKartDeg[13]; // 0x80413e74
    static const JGeometry::TVec3f scCharPos[2][2]; // 0x80413f10
    static const JGeometry::TVec3f scCharDeg[2][2]; // 0x80413f40
    static const char *scBloFileName; // 0x80415570
    static const char *scBckFileName; // 0x80415574
    static f32 sScr1OpenFrame; // 0x80415578
    static f32 sScr2OpenFrame; // 0x8041557c
    static const f32 scGPortWidth; // 0x80417190
    static const f32 scGPortHeight; // 0x80417194
    static const f32 scGPortH; // 0x80417198
    static const f32 scAspect; // 0x8041719c
    // Inline/Unused
    void viewCalc();
    void update();
    static void *scDecideButton;
    static const char *scPictureNama;
    static int scPlayerNum;
    static f32 scGPortX;
    static f32 scGPortY;
    // Inline
    virtual ~SecretScene(); // 0x802d967c
    virtual void MoveExec(); // 0x802da264
    virtual void InitExec(); // 0x802da1f8

private:
    J2DAnmTransform *mTransform;      // 18
    J2DScreen *mScreen;               // 1c
    J2DPictureEx *mPicture;           // 20
    PLACEHOLDER_BYTES(0x24, 0x38);    // 24, unused
    TAutoPWindow *mAutoPWindow;       // 38
    const TMesgList *mMesgList;       // 3c
    CharacterSelect3D *mCharSelect3D; // 40
    ECharID mCharIDs[2];              // 44, 48
    u8 _4c;                           //
    J2DOrthoGraph *mOrtho;            // 50
    JPEffectMgr *mEffectMgr;          // 54
    JPABaseEmitter *mEmitter;         // 58
    const ResTIMG *mResource[5];      // 5c
    u32 mSecretID;                    // 70
}; // class SecretScene

#endif // SECRETSCENE_H
